app/Controllers/ClientController.php

SELECT *
FROM `clients`
WHERE `numero` = '371234567'
 LIMIT 1
---
    public function accueil()
    {
        if ($this->request->getMethod() === 'POST') {
            $numero = $this->request->getPost('numero');

            $validation = \Config\Services::validation();
            $validation->setRule('numero', 'Numéro', 'valide_prefixe');

            if (!$validation->withRequest($this->request)->run()) {
                return redirect()->back()
                    ->with('error', $validation->getError('numero'));
            }

            $client = $this->clientModel
                ->where('numero', $numero)
                ->first();

SELECT *
FROM `clients`
WHERE `clients`.`id` = 1
---
    public function home()
    {
        $clientId = session()->get('client_id');

        if (!$clientId) {
            return redirect()->to('/');
        }

        $client = $this->clientModel->find($clientId);